/**
  ******************************************************************************
  * @文件  button.h
  * @作者  铁头山羊
  * @简介  适用于FreeRTOS的按钮驱动的头文件。
  ******************************************************************************
  */

/* 防止头文件被递归引用而添加的宏 ----------------------------------------------------*/
#ifndef __BUTTON_H_
#define __BUTTON_H_

/* 引用 -----------------------------------------------------------------------*/
#include <stdint.h>


/* 数据类型定义 -----------------------------------------------------------------*/
/**
  * @简介 按钮初始化时用于传递参数的结构体类型
  */
typedef struct
{
	uint32_t LongPressTime;                     /* 定义按钮“长按”动作的最短触发时间，以毫秒为单位 */

	uint32_t LongPressRepeatInterval;           /* 长按动作达成后继续按下按钮会产生一系列重复触发，此参数定义重复触发的时间
	                                               间隔，以毫秒为单位 */

	void (*InitCallback)(void);                 /* 由用户提供的用于按钮初始化的回调函数，一般包含IO的硬件初始化。如无需初始
	                                               化该参数可以填NULL */

	uint8_t (*ReadPinStateCallback)(void);      /* 由用户提供的用于读取按钮引脚状态的函数，不能为空。用户提供的该回调函数应
	                                               该能够正确地返回按钮引脚的当前电压 - 高电压时返回1，低电压时返回0 */

	uint32_t (*GetTimeCallback)(void);          /* 由用户提供的用于获取当前时间的回调函数，不能为空。用户提供的该回调函数应该
	                                               能够正确地返回系统的当前时间，单位为毫秒 */

	void (*ClickedCallback)(void);              /* 由用户提供的按钮按下的回调函数。按钮扫描过程中一旦检查到按钮的按下动作就会
	                                               自动调用此回调函数。该回调函数包含了按钮按下时应该执行的动作。如按钮按下时
	                                               无需执行动作，则该参数可以填NULL */

	void (*LongPressCallback)(uint16_t repeat); /* 由用户提供的按钮长按的回调函数。按钮扫描过程中一旦检查到长按动作或者长
	                                               按动作被重复触发就会自动调用此回调函数。该函数包含了按钮长按时应当执行
	                                               的动作。如按钮长按时无需执行动作，则该参数可以填NULL。repeat参数表
	                                               示按钮重复触发的次数，首次触发时repeat = 1 */
}Button_InitTypeDef;

/**
  * @简介：按钮结构体，用来存储按钮运行过程中的各种信息
  */
typedef struct
{
	Button_InitTypeDef Init;                    /* 该参数存储了按钮的初始化信息，包括用户提供的回调函数等，具体请参考
	                                               @ref Button_InitTypeDef */

	uint8_t PreviousKeyState;                   /* 记录按钮引脚上次的电压值，0 - 低电压；1 - 高电压 */

	uint32_t DebounceTimeOut;                   /* 记录按钮的消抖超时时间，单位毫秒。如果当前时间比这个值小，则说明按钮目前处
	                                               于消抖抑制阶段。 */

	uint32_t PreviousPressTime;                 /* 记录按钮上次按下的时间，单位毫秒 */

	uint16_t LongPressRepeatCount;              /* 按钮长按的重复触发计数。长按第一次触发时等于1，后续每触发一次该参数加1 */

	uint32_t PreviousRepeatTime;                /* 记录上次重复触发的时间，单位毫秒 */

}Button_TypeDef;


/* 函数定义 ---------------------------------------------------------------------*/
/**
  * @简介：按钮初始化函数。在使用按钮的其它功能之前务必先调用此函数
  * @参数：Button 按钮结构体指针
  * @参数：Init   初始化参数，具体参考 @ref Button_InitTypeDef
  */
void Button_Init(Button_TypeDef *Button, Button_InitTypeDef *Init);

/**
  * @简介：按钮扫描函数，执行按钮扫描动作。需要被等间隔重复调用，一般推荐以10ms~20ms为间隔调用该函数。
  * @参数：Button 按钮结构体指针
  */
void Button_Scan(Button_TypeDef *Button);

#endif /* INC_KEY_H_ */
